# TrussBadTransformation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures..::..TrussBadTransformation Property
BuiltInFailures..::..TrussFailures Class See Also
---
Revit cannot transform the truss Layout Family to the Truss as oriented in the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussBadTransformation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussBadTransformation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussBadTransformation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TrussFailures Class
Autodesk.Revit.DB Namespace